//Bellman-Ford Implementation(C++)
// .
// .
// .
// .
// .
// .
// .
// .
// .
// .
// .
// .
// .
// .
// .
// .
{
؛()pɹoɟuɐɯllǝq 
}
()uıɐɯ ʇuı
{
{ 
؛lpuǝ >> 1 >> "->" >> x >> ʇnoɔ 
{ 
؛[x]ǝɹd = x 
؛"->" >> x >> ʇnoɔ 
} 
(1 =¡ [x]ǝɹd)ǝlıɥʍ 
؛ı = x ʇuı 
؛" :" >> ı >> " oʇ " >> 1 >> ʇnoɔ 
} 
(++ı ؛ǝ => ı ؛2 = ı ʇuı) ɹoɟ 
{ 
{ 
{ 
؛lpuǝ >> "[ı][ɾ]ʇsıp + [ɾ]p => [ı]p" >> ʇnoɔ ǝslǝ 
{ 
؛ɾ = [ı]ǝɹd 
؛[ı][ɾ]ʇsıp + [ɾ]p = [ı]p 
؛lpuǝ >> ɾ >> " = [ı]ǝɹd '" >> [ı][ɾ]ʇsıp + [ɾ]p >> " = [ı][ɾ]ʇsıp + [ɾ]p < [ı]p" >> ʇnoɔ 
} 
([ı][ɾ]ʇsıp + [ɾ]p < [ı]p) ɟı 
؛" '" >> ɾ >> " = ɾ '" >> ı >> " = ı" >> ʇnoɔ 
} 
(++ɾ ؛ǝ => ɾ ؛1 = ɾ ʇuı) ɹoɟ 
} 
(++ı ؛ǝ => ı ؛1 = ı ʇuı) ɹoɟ 
؛lpuǝ >> lpuǝ >> ʞ >> " = ʞ" >> lpuǝ >> lpuǝ >> ʇnoɔ 
} 
(++ʞ ؛ǝ > ʞ ؛1 = ʞ ʇuı) ɹoɟ 
؛1 = [1]ǝɹd 
؛0 = [1]p 
{ 
{ 
{ 
؛x = [ɾ]p 
؛1 = [ɾ]ǝɹd 
} 
 (1 == ı) ɟı 
؛x = [ɾ][ı]ʇsıp 
؛ǝnuıʇuoɔ (9ǝ1 == x) ɟı 
؛ǝnuıʇuoɔ (ɾ == ı) ɟı 
؛x << uıɔ 
} 
(++ɾ ؛ǝ => ɾ ؛1 = ɾ ʇuı) ɹoɟ 
} 
(++ı ؛ǝ => ı ؛1 = ı ʇuı) ɹoɟ 
؛z 'ʎ 'x ʇuı 
{ 
؛0 = [ı][ı]ʇsıp 
؛9ǝ1 = [ɾ][ı]ʇsıp (++ɾ ؛ǝ => ɾ ؛0 = ɾ ʇuı) ɹoɟ 
؛9ǝ1 = [ı]p 
؛9ǝ1 = [ı]ǝɹd 
} 
(++ı ؛ǝ => ı ؛0 = ı ʇuı) ɹoɟ 
؛[1 + ǝ][1 + ǝ]ʇsıp '[1 + ǝ]p ʇuı 
؛[1 + ǝ]ǝɹd ʇuı 
؛ǝ << uıɔ 
؛9 = ʌ '5 = ǝ ʇuı 
}
()pɹoɟuɐɯllǝq pıoʌ
؛pʇs ǝɔɐdsǝɯɐu ƃuısn
<ɥ˙++ɔpʇs/sʇıq> ǝpnlɔuı#